Repository: CaroolSantos/refactool
Catalog: mptris-1.9/po/*.po
Languages: it

source: Purpose: mptris is a tic-tac-toe game. Usage: %s [OPTIONS]... -h --help Print help and exit -V --version Print version and exit -lINT --level=INT The difficulty level -d --autodisplay Displays the game board automatically (default=on)
it: Descrizione: mptris è un gioco di tic-tac-toe. Uso: %s [OPZIONI]... -h --help Mostra l'aiuto ed esce -V --version Mostra la versione ed esce -lINT --level=INT Il livello di difficoltà -d --autodisplay Mostra la griglia di gioco automaticamente (predefinito=abilitato)

source: %s: `--level' (`-l') option given more than once
it: %s: l'opzione "--level" ("-l") è stata specificata più di una volta

source: %s: `--autodisplay' (`-d') option given more than once
it: "%s: l'opzione "--autodisplay" ("-d\") è stata specificata più di una volta"

source: %s: option unknown: %c
it: %s: opzione sconosciuta: %c

source: mptris version %s, Copyright (C) 2000,2002 Marco Parrone. mptris comes with ABSOLUTELY NO WARRANTY; for details type "w [RETURN]". This is free software, and you are welcome to redistribute it under certain conditions; type "c [RETURN]" for details.
it: mptris versione %s, Copyright (C) 2000,2002 Marco Parrone. mptris viene offerto ASSOLUTAMENTE SENZA ALCUNA GARANZIA; si prema "w [INVIO]" per i dettagli. Questo è software libero e la ridistribuzione è permessa ed incoraggiata secondo certe condizioni; premere "c [INVIO]" per i dettagli.

source: Insert level (0-9):
it: Inserire il livello (0-9):

source: invalid level "%c".
it: livello «%c» non valido.

source: Do you want autodisplay active?
it: Si vuole che la visualizzazione automatica sia attiva?

source: Commands: w Shows details about the NON-warranty c Shows copying conditions details h Shows this help. 1-9 Inserts the X in the respective entry (numpad-like mapping). p Shows the game board. k Shows the key-mapping of the game-board l Shows the current difficulty level. L Changes the difficulty level. d Shows if autodisplaying is enabled. D Changes the autodisplay status. r Resets. q Quits.
it: w Mostra dettagli a proposito della mancanza di garanzia. c Mostra i dettagli delle condizioni di copia. h Mostra questa guida. 1-9 Inserisce la X nel rispettivo campo (mappatura simile a quella del tastierino numerico). p Mostra la griglia di gioco. k Mostra la mappatura dei tasti della griglia di gioco. l Mostra l'attuale livello di difficoltà. L Cambia il livello di difficoltà. d Mostra se la visualizzazione automatica è abilitata. D Cambia lo stato della visualizzazione automatica. r Resetta. q Esce.

source: Difficulty level: %u/10
it: Livello di difficoltà: %u/10

source: Autodisplay is %s.
it: La visualizzazione automatica è %s.

source: on
it: abilitata

source: off
it: disabilitata

source: invalid command "%c"
it: comando «%c» non valido

source: game over.
it: gioco finito.

source: invalid command: entry not empty
it: comando non valido: campo non vuoto

source: You won.
it: Hai vinto.

source: You losed.
it: Hai perso.

source: Game drawn.
it: Pareggio.

source: wrong argument to "--level" ("-l")
it: argomento non valido a «--level» («-l»)

source: cannot alloc memory for board
it: Non è possibile allocare memoria per la scacchiera

source: Type "h [RETURN]" for help.
it: Premere "h [INVIO]" per una guida.
